#### Terraform Initialization ⚙️`success`


#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
alicloud_vpc.terraform_state: Refreshing state... [id=vpc-l4ve6sudx3ssogpakzrfl]
alicloud_vswitch.public: Refreshing state... [id=vsw-l4vago84jvt0kdgmzn8mi]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # alicloud_vswitch.private will be created
  + resource "alicloud_vswitch" "private" {
      + availability_zone    = (known after apply)
      + cidr_block           = "10.0.2.0/24"
      + create_time          = (known after apply)
      + id                   = (known after apply)
      + ipv6_cidr_block      = (known after apply)
      + ipv6_cidr_block_mask = (known after apply)
      + name                 = (known after apply)
      + status               = (known after apply)
      + vpc_id               = "vpc-l4ve6sudx3ssogpakzrfl"
      + vswitch_name         = "private"
      + zone_id              = "me-central-1a"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @askhalil, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Plan`*